In [2]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [2]:
obj = Series([4,7,-5,3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = Series([4,7,-5], index=['d','b','a'])

In [7]:
obj2

d    4
b    7
a   -5
dtype: int64

In [8]:
obj2.index

Index(['d', 'b', 'a'], dtype='object')

In [9]:
obj2['a'] = 11
obj2

d     4
b     7
a    11
dtype: int64

In [11]:
obj2[obj2>5]

b     7
a    11
dtype: int64

In [12]:
obj2*2

d     8
b    14
a    22
dtype: int64

In [15]:
np.exp(obj2)

d       54.598150
b     1096.633158
a    59874.141715
dtype: float64

In [16]:
'a' in obj2

True

In [18]:
sdata = {'Ohio':35000, 'Texas':71000,'Oregon':16000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
dtype: int64

In [19]:
states = ['Cal', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index = states)
obj4

Cal           NaN
Ohio      35000.0
Oregon    16000.0
Texas     71000.0
dtype: float64

In [20]:
pd.isnull(obj4)

Cal        True
Ohio      False
Oregon    False
Texas     False
dtype: bool

In [21]:
pd.notnull(obj4)

Cal       False
Ohio       True
Oregon     True
Texas      True
dtype: bool

In [22]:
obj3+obj4

Cal            NaN
Ohio       70000.0
Oregon     32000.0
Texas     142000.0
dtype: float64

In [24]:
obj.index = ['a','b','c','d']

In [4]:
data = {'state':['ohio','nevada'],'year':[2000,2001],'pop':[1.5,1.7]}
frame = DataFrame(data)

In [27]:
frame

   pop   state  year
0  1.5    ohio  2000
1  1.7  nevada  2001

In [28]:
DataFrame(data, columns=['year','state','pop'])

   year   state  pop
0  2000    ohio  1.5
1  2001  nevada  1.7

In [5]:
frame2 = DataFrame(data, columns=['year','state','pop','debt'], index=['a','b'])
frame2

   year   state  pop debt
a  2000    ohio  1.5  NaN
b  2001  nevada  1.7  NaN

In [6]:
frame2['state']

a      ohio
b    nevada
Name: state, dtype: object

In [7]:
frame2.loc['a']

year     2000
state    ohio
pop       1.5
debt      NaN
Name: a, dtype: object

In [42]:
frame2['eastern']=frame2.state=='ohio'
frame2

   year   state  pop debt  eastern
a  2000    ohio  1.5  NaN     True
b  2001  nevada  1.7  NaN    False

5-2 pandas中的index
5-3 index的方法

In [44]:
obj = Series([3,4,5])
obj2 = obj.reindex([1,2,3])
obj2

1    4.0
2    5.0
3    NaN
dtype: float64

In [46]:
obj2 = obj.reindex([1,2,3], fill_value=0)
obj2

1    4
2    5
3    0
dtype: int64

In [47]:
obj.reindex([1,2,3], method='ffill')

1    4
2    5
3    5
dtype: int64

5-6 索引的选取
obj[val] 选单列或一组列
obj.ix[val] 选单行或一组行

In [48]:
data = DataFrame(np.arange(16).reshape((4,4)), index=['ohio', 'colorado', 'utah', 'new york'], columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [49]:
data['two']

ohio         1
colorado     5
utah         9
new york    13
Name: two, dtype: int32

In [50]:
data[['two','one']]

          two  one
ohio        1    0
colorado    5    4
utah        9    8
new york   13   12

In [51]:
data[:2]

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7

In [52]:
data[data['three']>5]

          one  two  three  four
colorado    4    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [53]:
data<5

            one    two  three   four
ohio       True   True   True   True
colorado   True  False  False  False
utah      False  False  False  False
new york  False  False  False  False

In [54]:
data[data<5] = 0
data

          one  two  three  four
ohio        0    0      0     0
colorado    0    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [56]:
data.loc['colorado', ['two','three']]

two      5
three    6
Name: colorado, dtype: int32

In [58]:
data.iloc[1,[0,1]]

one    0
two    5
Name: colorado, dtype: int32

In [59]:
df1 = DataFrame(np.arange(12).reshape((3,4,)), columns=list('abcd'))
df2 = DataFrame(np.arange(20).reshape((4,5)), columns=list('abcde'))
df1;df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [60]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [61]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [62]:
df1.reindex(columns=df2.columns, fill_value=0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

In [63]:
arr = np.arange(12).reshape((3,4))
arr-arr[0] #broadcasting

array([[0, 0, 0, 0],
       [4, 4, 4, 4],
       [8, 8, 8, 8]])

In [64]:
arr[0]

array([0, 1, 2, 3])

In [65]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [66]:
frame = DataFrame(np.arange(12).reshape((4,3)), columns=list('dbe'), index=['utah', 'ohio','texa','oregon'])
series = frame.iloc[0]
frame

        d   b   e
utah    0   1   2
ohio    3   4   5
texa    6   7   8
oregon  9  10  11

In [67]:
series

d    0
b    1
e    2
Name: utah, dtype: int32

In [68]:
frame-series

        d  b  e
utah    0  0  0
ohio    3  3  3
texa    6  6  6
oregon  9  9  9

In [74]:
series2 = Series(range(3), index=['b','e','f'])
frame+series2

           b   d     e   f
utah     1.0 NaN   3.0 NaN
ohio     4.0 NaN   6.0 NaN
texa     7.0 NaN   9.0 NaN
oregon  10.0 NaN  12.0 NaN

In [72]:
series3 = frame['d']
frame.sub(series3,axis=0)

        d  b  e
utah    0  1  2
ohio    0  1  2
texa    0  1  2
oregon  0  1  2

In [75]:
frame['d']

utah      0
ohio      3
texa      6
oregon    9
Name: d, dtype: int32

In [76]:
f = lambda x:x.max()-x.min()
frame.apply(f)

d    9
b    9
e    9
dtype: int64

In [77]:
obj = Series(range(4), index=list('dabc'))
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [78]:
frame = DataFrame(np.arange(8).reshape((2,4)), index=['three', 'one'], columns=list('dabc'))
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [79]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [80]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [83]:
obj = Series([4,7,-3,2])
obj.sort_index()

0    4
1    7
2   -3
3    2
dtype: int64

In [89]:
frame.sort_values(by=['a','b'])

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [90]:
frame.sum(axis=1)

three     6
one      22
dtype: int64

In [91]:
frame.sum()

d     4
a     6
b     8
c    10
dtype: int64

In [93]:
import tushare as ts

In [104]:
data = ts.get_hist_data('300412')
data.head()

,open,high,close,low,volume,price_change,p_change,ma5,ma10,ma20,v_ma5,v_ma10,v_ma20,turnover
date,,,,,,,,,,,,,,
2017-09-22,13.04,13.04,12.80,12.67,11096.60,-0.26,-1.99,13.014,13.095,13.200,9181.70,9821.26,16568.97,1.38
2017-09-21,13.23,13.25,13.06,13.06,8963.00,-0.17,-1.28,13.060,13.128,13.214,8842.38,11229.45,18344.37,1.11
2017-09-20,12.97,13.24,13.23,12.88,10462.34,0.30,2.32,13.074,13.178,13.196,9059.58,14161.46,19507.93,1.30
2017-09-19,13.08,13.13,12.93,12.91,6731.18,-0.12,-0.92,13.088,13.171,13.179,8597.12,14726.31,22210.59,0.84
2017-09-18,13.08,13.09,13.05,12.88,8655.40,0.02,0.15,13.138,13.216,13.140,10115.10,15608.59,23180.04,1.08

In [96]:
returns = data['close'].pct_change()

In [97]:
returns.head()

date
2017-09-22         NaN
2017-09-21    0.020312
2017-09-20    0.013017
2017-09-19   -0.022676
2017-09-18    0.009281
Name: close, dtype: float64

In [99]:
data = Series([1,np.nan, 3.5, np.nan,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [100]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [101]:
data.fillna(0)

0    1.0
1    0.0
2    3.5
3    0.0
4    7.0
dtype: float64

In [102]:
data.fillna(method='ffill')

0    1.0
1    1.0
2    3.5
3    3.5
4    7.0
dtype: float64

In [105]:
data.index

Index(['2017-09-22', '2017-09-21', '2017-09-20', '2017-09-19', '2017-09-18',
       '2017-09-15', '2017-09-14', '2017-09-13', '2017-09-12', '2017-09-11',
       ...
       '2015-01-15', '2015-01-14', '2015-01-13', '2015-01-12', '2015-01-09',
       '2015-01-08', '2015-01-07', '2015-01-06', '2015-01-05', '2014-12-31'],
      dtype='object', name='date', length=596)

In [106]:
data.columns

Index(['open', 'high', 'close', 'low', 'volume', 'price_change', 'p_change',
       'ma5', 'ma10', 'ma20', 'v_ma5', 'v_ma10', 'v_ma20', 'turnover'],
      dtype='object')

对传播是什么样还不知道